from typing import Any

# Settings for calculation in models

MASS_OF_METER: dict[int | Any, float | Any] = {
    6: 0.222,
    8: 0.395,
    10: 0.617,
    12: 0.888,
    14: 1.210,
    16: 1.580,
    18: 2.000,
    20: 2.470,
    22: 2.980,
    25: 3.850,
    28: 4.830,
    32: 6.310,
    36: 7.990,
    40: 9.870,
}

MM_IN_M: int = 1000

# Rounding

NUM_OF_DECIMALS: int = 2
NUM_OF_DECIMALS_OF_INTEGER: int = 0


# Choices for forms

DIAMETERS = (
    ('6', '6'),
    ('8', '8'),
    ('10', '10'),
    ('12', '12'),
    ('14', '14'),
    ('16', '16'),
    ('18', '18'),
    ('20', '20'),
    ('22', '22'),
    ('25', '25'),
    ('28', '28'),
    ('32', '32'),
    ('36', '36'),
    ('40', '40'),
)

ROD_CLASSES = (
    ('А240', 'А240'),
    ('А400', 'А400'),
    ('А500', 'А500'),
    ('А600', 'А600'),
    ('А800', 'А800'),
    ('А1000', 'А1000'),
)
